---
title: StructuralAsset
classe: Autodesk.Revit.DB.StructuralAsset
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 33
---

# StructuralAsset

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `StructuralBehavior Behavior { get; set; }` | `structuralAsset.Behavior` | StructuralBehavior |
| `Double ConcreteBendingReinforcement { get; set; }` | `structuralAsset.ConcreteBendingReinforcement` | Double |
| `Double ConcreteCompression { get; set; }` | `structuralAsset.ConcreteCompression` | Double |
| `Double ConcreteShearReinforcement { get; set; }` | `structuralAsset.ConcreteShearReinforcement` | Double |
| `Double ConcreteShearStrengthReduction { get; set; }` | `structuralAsset.ConcreteShearStrengthReduction` | Double |
| `Double Density { get; set; }` | `structuralAsset.Density` | Double |
| `Boolean IsValidObject { get; }` | `structuralAsset.IsValidObject` | Boolean |
| `Boolean Lightweight { get; set; }` | `structuralAsset.Lightweight` | Boolean |
| `Double MetalReductionFactor { get; set; }` | `structuralAsset.MetalReductionFactor` | Double |
| `Double MetalResistanceCalculationStrength { get; set; }` | `structuralAsset.MetalResistanceCalculationStrength` | Double |
| `Boolean MetalThermallyTreated { get; set; }` | `structuralAsset.MetalThermallyTreated` | Boolean |
| `Double MinimumTensileStrength { get; set; }` | `structuralAsset.MinimumTensileStrength` | Double |
| `Double MinimumYieldStress { get; set; }` | `structuralAsset.MinimumYieldStress` | Double |
| `String Name { get; set; }` | `structuralAsset.Name` | String |
| `XYZ PoissonRatio { get; set; }` | `structuralAsset.PoissonRatio` | XYZ |
| `XYZ ShearModulus { get; set; }` | `structuralAsset.ShearModulus` | XYZ |
| `StructuralAssetClass StructuralAssetClass { get; }` | `structuralAsset.StructuralAssetClass` | StructuralAssetClass |
| `String SubClass { get; set; }` | `structuralAsset.SubClass` | String |
| `XYZ ThermalExpansionCoefficient { get; set; }` | `structuralAsset.ThermalExpansionCoefficient` | XYZ |
| `Double WoodBendingStrength { get; set; }` | `structuralAsset.WoodBendingStrength` | Double |
| `String WoodGrade { get; set; }` | `structuralAsset.WoodGrade` | String |
| `Double WoodParallelCompressionStrength { get; set; }` | `structuralAsset.WoodParallelCompressionStrength` | Double |
| `Double WoodParallelShearStrength { get; set; }` | `structuralAsset.WoodParallelShearStrength` | Double |
| `Double WoodPerpendicularCompressionStrength { get; set; }` | `structuralAsset.WoodPerpendicularCompressionStrength` | Double |
| `Double WoodPerpendicularShearStrength { get; set; }` | `structuralAsset.WoodPerpendicularShearStrength` | Double |
| `String WoodSpecies { get; set; }` | `structuralAsset.WoodSpecies` | String |
| `XYZ YoungModulus { get; set; }` | `structuralAsset.YoungModulus` | XYZ |
| `StructuralAsset Copy()` | `structuralAsset.Copy()` | StructuralAsset |
| `Void Dispose()` | `structuralAsset.Dispose()` | Void |
| `Void SetPoissonRatio(Double)` | `structuralAsset.SetPoissonRatio(poissonRatio)` | Void |
| `Void SetShearModulus(Double)` | `structuralAsset.SetShearModulus(shearModulus)` | Void |
| `Void SetThermalExpansionCoefficient(Double)` | `structuralAsset.SetThermalExpansionCoefficient(thermalExpCoeff)` | Void |
| `Void SetYoungModulus(Double)` | `structuralAsset.SetYoungModulus(youngModulus)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```